#pragma once

// ---------------------------------------------------------
// C++ Includes
// ---------------------------------------------------------
#include <memory>

// ---------------------------------------------------------
// Application Includes
// ---------------------------------------------------------
#include <src/Game/Bullet/Base/Bullet.h>

// =========================================================
// 弾の管理を行うクラス
// =========================================================
class BulletManager {
public:
	// =========================================================
	// Public Methods
	// =========================================================

	/// <summary>
	/// 弾管理クラスのシングルトンインスタンスを返します。
	/// </summary>
	/// <returns>インスタンス</returns>
	static BulletManager* GetInstance();

	/// <summary>
	/// 弾を弾管理クラスに追加します。
	/// </summary>
	void AddBullet(std::unique_ptr<Bullet> bullet);

	/// <summary>
	/// 全ての弾の毎フレーム更新処理を行います。
	/// </summary>
	void Update();

	/// <summary>
	/// 全ての弾のモデル描画処理を行います。
	/// </summary>
	void Draw();

	/// <summary>
	/// 全ての弾を削除します。
	/// </summary>
	void Clear();

private:
	// =========================================================
	// Member Variables
	// =========================================================

	// ----- Container -----
	std::vector<std::unique_ptr<Bullet>> bullets_;			/* 全ての弾を格納したコンテナ */
};
