#pragma once

// ---------------------------------------------------------
// Engine Includes
// ---------------------------------------------------------
#include <Object3D.h>

// =========================================================
// 床オブジェクトのクラス
// =========================================================
class Field {
public:
	// =========================================================
	// Public Methods
	// =========================================================

	/// <summary>
	/// 床オブジェクトの初期化処理を行います。
	/// </summary>
	void Initialize();

	/// <summary>
	/// 毎フレームの更新処理を行います。
	/// </summary>
	void Update();

	/// <summary>
	/// モデルの描画処理を行います。
	/// </summary>
	void Draw();

	/// <summary>
	/// デバッグ用の描画処理を行います。
	/// </summary>
	void Debug();

private:
	// =========================================================
	// Member Variables
	// =========================================================

	// ----- Models -----
	std::unique_ptr<Object3D> objectFloor_;				/* 床オブジェクト */
};
