#pragma once

// ---------------------------------------------------------
// Engine Includes
// ---------------------------------------------------------
#include <Object3D.h>

// =========================================================
// 床オブジェクトのクラス
// =========================================================
class Field {
public:
	// =========================================================
	// Public Methods
	// =========================================================

	/// <summary>
	/// 床オブジェクトの初期化処理を行います。
	/// </summary>
	void Initialize();

	/// <summary>
	/// 毎フレームの更新処理を行います。
	/// </summary>
	void Update();

	/// <summary>
	/// モデルの描画処理を行います。
	/// </summary>
	void Draw();

private:
	// =========================================================
	// Constants
	// =========================================================
	static constexpr Cygnus::Float3 kScale = {500.0f, 500.0f, 1.0f}; /* オブジェクトのスケール */
	static constexpr Cygnus::Float4 kColor = {0.157f, 0.204f, 0.308f, 1.0f}; /* オブジェクトの色 */

	// =========================================================
	// Member Variables
	// =========================================================
	std::unique_ptr<Cygnus::Object3D> objectFloor_;				/* 床オブジェクト */
};
