#pragma once

// ---------------------------------------------------------
// Engine Includes
// ---------------------------------------------------------
#include <Sprite.h>
#include <SpriteCommon.h>

// =========================================================
// 汎用的なカーソルUIを表示するクラス
// タイトル・ポーズ・リザルトで使用
// =========================================================
class Cursor {
public:
	/// <summary>
	/// 初期化処理を行います。
	/// </summary>
	void Initialize();

	/// <summary>
	/// 更新処理を行います。
	/// </summary>
	void Update();

	/// <summary>
	/// 描画処理を行います。
	/// </summary>
	void Draw();

private:
	// =========================================================
	// Constants
	// =========================================================

	// =========================================================
	// Member Variables
	// =========================================================

	std::unique_ptr<Cygnus::SpriteCommon> spriteCommon_; /* スプライト共通処理 */

	std::unique_ptr<Cygnus::Sprite> spriteCursor_; /* カーソル用スプライト */
};
